of/org/pisoFoam/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.5750;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.5750;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        // type            epsilonWallFunction;
        // value           uniform 0.5750;
        type            symmetryPlane;
    }
    bottom
    {
        // type            epsilonWallFunction;
        // value           uniform 0.5750;
        type            symmetryPlane;
    }
    deck
    {
        type            epsilonWallFunction;
        value           uniform 0.5750;
        // type            symmetry;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
